# 대칭키 & 공개키

통신 내용이 공격자에게 노출되는 것을 막을려면 무엇이 필요할까? 바로 암호화다 이를 통해 노출되는 것을 막으며 통신 내용의 악의적인 변경을 방지할 수 있다.

암호화에 대해 알아 볼것인데 대표적으로 대칭키, 비대칭키라는 암호화 기법이 있다.
## 대칭키(Symmetric Key)
1. 암호화와 복호화에 같은 암호키를 사용하는 알고리즘 ex) 메모장에 1111이라는 비밀번호를 걸면 1111을 통해 다시 메모장 내용을 볼 수 있다.
2. 통신 내용을 감출려고 암호화 기법을 쓰니 서로 대칭키를 알아야한다. 그런데 대칭키도 똑같이 전달을 위한 통신 과정에서 해킹 위험에 노출 될 수 있다. 
3. 공개키에 비하여 암호화 복호화가 빠르다 [참고](https://blog.skby.net/%EB%8C%80%EC%B9%AD%ED%82%A4%EC%99%80-%EB%B9%84%EB%8C%80%EC%B9%AD%ED%82%A4-%EC%95%94%ED%98%B8%ED%99%94-%EC%95%8C%EA%B3%A0%EB%A6%AC%EC%A6%98-%EB%B9%84%EA%B5%90/)

⭐ 왜 대칭키가 공개키에 비하여 더 빠를까?
대칭키가 연산이나 속도에서 빠르며, 성능이 좋고 비용이 적은 이유는 주로 다음과 같습니다:

1. **간단한 구조:**
    - 대칭키 알고리즘은 간단한 구조로 되어 있습니다. 키 교환, 암호화 및 복호화에 사용되는 연산이 비교적 간단하고 직접적입니다. 이는 대칭키가 빠르게 작동할 수 있도록 도와줍니다.
2. **동일한 키 사용:**
    - 대칭키에서는 동일한 키가 암호화 및 복호화에 사용됩니다. 이로 인해 연산이 간소화되어 성능이 향상되며, 특히 대량의 데이터에 대한 처리에서 유리합니다.
3. **작은 키 공간:**
    - 대칭키의 키 공간이 상대적으로 작습니다. 작은 키 공간은 키 교환 및 저장에 필요한 자원이 적다는 의미이며, 따라서 성능이 향상되고 비용이 감소합니다.
4. **비대칭키에 비해 복잡하지 않음:**
    - 비대칭키 알고리즘은 대칭키에 비해 수학적으로 복잡한 구조를 가지고 있습니다. 공개키 및 개인키의 생성, 관리, 교환 등에 관련된 프로세스가 복잡하고 자원 소모가 큽니다. 대칭키는 이러한 복잡성이 적어서 더 간편하게 사용할 수 있습니다.
5. **적은 연산량:**
    - 대칭키는 데이터를 암호화 및 복호화할 때 적은 연산을 수행합니다. 특히, 데이터 양이 많을수록 대칭키가 효율적으로 작동합니다.
## 공개키(Public Key) / 비대칭 키 (Asymmetricy key)
1. 암호화와 복호화에 사용하는 암호키를 분리한 알고리즘 
2. 대칭키의 키 분배 문제를 해결하기 위해 고안되었다, 중간에 탈취한다 하더라도 복호화 할 수 없기때문에 더 안전하다.(대칭키를 공유할때 쓰는 암호화 기법으로 공개키 방법을 쓴다)

### 공개키 사용 예시
#### 내용 보호
공개키로 암호화하고 개인키로 복호화하면  보통 내용을 보호할때 쓰는것이다. 즉 데이터의 내용이 다른 사람에게 알려지면 안되는 경우 이렇게 사용하며 오직 개인키로만 복호화가 가능하다.

#### 인증 (전자 서명)

⭐ 인증이란?
인증 이라는 것은 무엇이냐면 그 사람이 맞다라는 것을 인증하는 것이다. 이걸 공개키로 할 수 있는데 어떻게 하는것일까?

⭐ 공개키를 사용하여 인증
바로 비밀키(개인키)로 암호화하고 공개키로 복호화 하는것이다.  비밀키를 가지고 암호화한걸 공개키로 복호화 했다면 그 사람이 보냈다는걸 확신할 수 있기 때문이다.

⭐ 왜이런 방식을 택하게 되었나요?
각종 문서들이 종이에서 디지털로 전환되면서 진위성과 무결성을 검증하는 도구가 필요하게 되었다. 그래서 공개키를 이용해 전자서명을 암호화 하게되었는데 개인키로 암호화, 공개키로 복호화하여 전자 서명을 감출 수 있다.  (신뢰할 수 있는 단체라는 것을 인증하는 관점)

[참고](https://myjamong.tistory.com/293)
[참고](https://about-tech.tistory.com/entry/Security-%EB%94%94%EC%A7%80%ED%84%B8-%EC%84%9C%EB%AA%85Digital-Signature%EC%9D%B4%EB%9E%80-%EA%B2%80%EC%A6%9D-%ED%99%95%EC%9D%B8-%EC%9B%90%EB%A6%AC)

보안적인 측면에서는 비대칭키가 강력하지만, 대칭키에 비해 연산이 느린 특성이 있습니다. 현실적으로는 이러한 차이를 극복하기 위해 암호화 표준과 프로토콜에서는 대칭키와 비대칭키를 조합하여 사용하고 있습니다. 대칭키를 사용하여 데이터를 암호화하고, 비대칭키를 사용하여 대칭키를 안전하게 교환하고 서명 및 인증을 수행하는 방식이 많이 사용됩니다.
# HTTP & HTTPS & SSL

## HTTP란? HTTPS란?
Hypertext Transfer Protocol의 약자 즉 말 그대로 Transfer 전송 Protocol 규약 전송 규약인데Hypertext인 HTML을 전송하기 위한 통신규약을 의미한다.

HTTPS에서 S는 Over Secure Socket Layer이다 보통 Secure라고 함축하여 표현한다. (소켓(_Socket_)_이란_ 네트워크상에서 동작하는 프로그램 간 통신의 종착점(Endpoint))
말 그대로 HTTP에 암호화를 통해 보안을 강화한 것이다. HTTP는 암호화 되지 않은 방법으로 데이터를 전송하는데 이를 보완하기 위해 나온것이다.

HTTPS는 SSL 프로토콜 위에서 돌아가는 프로토콜이다 . HTTPS와 SSL을 같다 표현하는 사람들이 있는데 인터넷과 웹을 같은 의미로 이해하는 것과 같다. 웹이 인터넷 위에서 돌아가듯이 말이다.
## SSL과 TLS

### SSL이란?

쉽게 말해 데이터를 안전하게 전송하기 위한 인터넷 암호화 통신 프로토콜(보안 프로토콜)인 것입니다. 개인정보 보호, 인증, 무결성을 인터넷 통신에 제공**합니다.  

어렵게 말하고자 하면 서버와 클라이언트간 통신하기 전에 CA를 통해 서버를 인증하는 과정과 데이터를 암호화하여 통신하는 과정을 아우른 프로토콜을 TLS 또는 SSL이라고 말합니다. (*SSL과 TLS는 사실상 동일한 규약을 뜻하며 SSL이 표준화되며 바뀐 이름이 TLS입니다.)

### SSL 디지털 인증서란?
SSL 인증서는 SSL을 통해 데이터를 안전하게 전송하는 것을 보증 해주는 문서이다 (클라이언트와 서버간의 통신을 제3자가 보증해주는 전자화된 문서다 ) 즉 쉽게 말해 여기는 SSL 방식을 통해 안전하게 통신한다 보증이 되있는 곳이다.

보증만 하는 것일까? 아니다 인증서의 기능은 크게 두가지다. 이 두가지를 이해하는 것이 인증서를 이해하는 핵심이다.

1. 클라이언트가 접속한 서버가 신뢰 할 수 있는 서버임을 보장한다.
2. SSL 통신에 사용할 공개키를 클라이언트에게 제공한다.

SSL을 통해 브라우저는 인증서의 도메인과 데이터를 제공하는 서버의 도메인을 비교할 수 있으므로 '중간자 공격'을 감지하여 보안 위협으로부터 사용자 및 사용자의 데이터를 보호할 수 있습니다. 
또한 경고를 직접 보여줌으로써 브라우저들은 인증된 CA가 발급한 인증서를 이용하여 데이터를 제공하는 **안전한 서버를 사용자가 사용하도록 유도합니다.**

SSL을 사용하는 다양한 주체가 있다 브라우저,서버등등이 있다.

### 이런 인증서를 어디서 발급해줄까?

인증서의 역할은 클라이언트가 접속한 서버가 클라이언트가 의도한 서버가 맞는지를 보장하는 역할을 한다. 이 역할을 하는 민간기업들이 있는데 이런 기업들을 CA(Certificate authority) 혹은 Root Certificate 라고 부른다. 즉 SSL을 통해서 암호화된 통신을 제공하려는 서비스는 CA를 통해서 인증서를 구입해야 한다


⭐ 이런 인증서는 어디에 있을까?
브라우저는 내부적으로 CA의 리스트를 미리 파악하고 있다. 이 말은 브라우저의 소스코드 안에 CA의 리스트가 들어있다는 것이다. 브라우저가 미리 파악하고 있는 CA의 리스트에 포함되어야만 공인된 CA가 될 수 있는 것이다. CA의 리스트와 함께 각 CA의 공개키를 브라우저는 이미 알고 있다.

개발이나 사적인 목적을 위해서 SSL의 암호화 기능을 이용하려한다면 자신이 직접 CA의 역할을 할 수도 있다. 물론 이것은 공인된 인증서가 아니기 때문에 이러한 사설 CA의 인증서를 이용하는 경우 브라우저는 아래와 같은 경고를 출력한다.

![](https://s3.ap-northeast-2.amazonaws.com/opentutorials-user-file/module/228/1536.gif)

### SSL 인증서의 내용
SSL 인증서에는 다음과 같은 정보가 포함되어 있다.
1. 서비스의 정보 (인증서를 발급한 CA, 어떤 서비스의 도메인 등등)
2. 서버 측 공개키 (공개키의 내용, 공개키의 암호화 방법)

> 서비스의 도메인, 공개키와 같은 정보는 서비스가 CA로부터 인증서를 구입할 때 제출해야 한다.

위와 같은 내용은 CA에 의해서 암호화 된다. 이 때 사용하는 암호화 기법이 비대칭키 방식이다. CA는 자신의 CA 비공개키(개인키)를 이용해서 서버가 제출한 인증서를 암호화하는 것이다. 공개키는 브라우저가 가지고 있다.

### SSL 통신 과정
⭐ 그런데 통신할때 대칭키, 비대칭키 중에 어떤 것으로 암호화를 해서 데이터를 보호하나요?
결론만 말하자면 두가지다 사용한다. 공개키 방식은 복호화 하는과정에서 비용을 많이 쓰게 되었고 이로인해 성능상 단점이 있게 되었다. 그래서 SSL 방식에서는 성능이 좋은 대칭키 방식과 비대칭키(공개키)를 혼합해서 사용한다.

⭐ 읭 근데 대칭키는 탈취될 위험이 있는데 어떻게 이를 해결했나요?
바로 공개키 방식으로 해결했다.  어떻게 공개키를 이용한 방식으로 해결할까?
아래의 통신 과정을 보면 알 수 있다.
#### 악수
실제 데이터를 주고 받기 전에 클라이언트와 서버는 일종의 인사인 Handshake(진짜로 사용하는 기술용어다)를 한다. 이 과정을 통해서 서로 상대방이 존재하는지, 또 상대방과 데이터를 주고 받기 위해서는 어떤 방법을 사용해야하는지를 파악한다.

1. 클라이언트가 서버에 접속한다.  클라이언트 헬로우(클라이언트가 서버에접속하는걸 뜻함) 이 단계에서 주고 받는 정보는 아래와 같다.
	1.  클라이언트 측에서 생성한 랜덤 데이터 
	2. 클라이언트가 지원하는 암호화 방식들 : 클라이언트와 서버가 지원하는 암호화 방식이 서로 다를 수 있기 때문에 상호간에 어떤 암호화 방식을 사용할 것인지에 대한 협상을 해야 한다. 이 협상을 위해서 클라이언트 측에서는 자신이 사용할 수 있는 암호화 방식을 전송한다.
	3. 세션 아이디 : 이미 SSL 핸드쉐이킹을 했다면 비용과 시간을 절약하기 위해서 기존의 세션을 재활용하게 되는데 이 때 사용할 연결에 대한 식별자를 서버 측으로 전송한다.
2. 서버는 Client Hello에 대한 응답으로 Server Hello를 하게 된다. 이 단계에서 주고 받는 정보는 아래와 같다.
	1.  서버 측에서 생성한 랜덤 데이터
	2. 서버가 선택한 클라이언트의 암호화 방식 : 클라이언트가 전달한 암호화 방식 중에서 서버 쪽에서도 사용할 수 있는 암호화 방식을 선택해서 클라이언트로 전달한다. 이로써 암호화 방식에 대한 협상이 종료되고 서버와 클라이언트는 이 암호화 방식을 이용해서 정보를 교환하게 된다.
	3. 인증서
3. 클라이언트는 서버의 응답을 받아 다음과 같은 일들을 처리한다.
	1. 서버에게 받은 인증서를 CA를 통해 확인한다. (믿을만한 서버인가 확인하는 과정)
		1. 서버의 인증서가 CA에 의해서 발급된 것인지를 확인하기 위해서 클라이언트에 내장된 CA 리스트를 확인한다.
		2. 있다면 클라이언트에 내장된 CA의 공개키를 이용해서 인증서를 복호화한다. 복호화에 성공한다면 인증에 성공한 것이다. 또한 서버의 공개키를 획득한다.
		3. 없다면 사용자에게 경고 메시지를 출력한다.
	3. 클라이언트는 대칭키를 생성해 서버의 공개키로 암호화하여 서버로 보내준다.
		1. pre master secret값을 어떻게 한다 하는데 여기서 중요한건 아닌것 같아 링크로 남긴다 [참고](https://opentutorials.org/course/228/4894#public)
4. 서버는 받은 대칭키 값을 자신이 가지고 있는 비공개키로 복호화한다.
5. 클라이언트와 서버는 핸드쉐이크 단계를 종료하며 서로에게 알린다.

#### 세션

세션은 실제로 서버와 클라이언트가 데이터를 주고 받는 단계이다. 이 단계에서 핵심은 정보를 상대방에게 전송하기 전에 session key 값을 이용해서 대칭키 방식으로 암호화 한다는 점이다. 암호화된 정보는 상대방에게 전송될 것이고, 상대방도 세션키 값을 알고 있기 때문에 암호를 복호화 할 수 있다.

⭐ 그냥 공개키를 사용하면 될 것을 대칭키와 공개키를 조합해서 사용하는 이유는 무엇을까?  
그것은 공개키 방식이 많은 컴퓨터 파워를 사용하기 때문이다. 만약 공개키를 그대로 사용하면 많은 접속이 몰리는 서버는 매우 큰 비용을 지불해야 할 것이다. 반대로 대칭키는 암호를 푸는 열쇠인 대칭키를 상대에게 전송해야 하는데, 암호화가 되지 않은 인터넷을 통해서 키를 전송하는 것은 위험하기 때문이다. 그래서 속도는 느리지만 데이터를 안전하게 주고 받을 수 있는 공개키 방식으로 대칭키를 암호화하고, 실제 데이터를 주고 받을 때는 대칭키를 이용해서 데이터를 주고 받는 것이다.

#### 세션 종료
데이터의 전송이 끝나면 SSL 통신이 끝났음을 서로에게 알려준다. 이 때 통신에서 사용한 대칭키인 세션키를 폐기한다. 만약 세션키를 탈취당했더라도 짧은 시간에 쓰고 다시 재생성되기때문에 문제가 없어진다.



# FTP & SFTP & SSH

HTML을 통신하기 위한 규약에 HTTP가 있다면 파일과 관련된 통신 규약은 FTP와 SFTP 등이 있습니다.

FTP와 SFTP는 모두 파일 전송 프로토콜(File Transfer Protocol)입니다. 하지만 두 프로토콜은 중요한 차이점이 있습니다.

1. 보안:
    - FTP는 보안 기능이 없는 평문 텍스트 전송 프로토콜입니다. 데이터 전송 시 암호화되지 않고, 사용자 이름과 비밀번호도 평문으로 전송됩니다. 따라서, FTP는 보안에 취약합니다.
    - SFTP는 SSH(Secure Shell) 위에서 동작하는 파일 전송 프로토콜로, 데이터 전송과 인증 과정이 암호화됩니다. SFTP는 SSH의 보안 기능을 활용하여 안전한 파일 전송을 제공합니다.

⭐ 위에서 나온 SSH는 뭘까요? 
SSH는 "Secure Shell"의 약어로, 원격으로 컴퓨터나 서버에 안전하게 접속하기 위해 사용되는 프로토콜입니다.

즉, 네트워크 프로토콜 중 하나로 컴퓨터와 컴퓨터가 인터넷과 같은 Public Network를 통해서 서로 통신을 할 때 보안적으로 안전하게 통신을 하기 위해 사용하는 프로토콜입니다.

대표적으로 데이터 전송 , 원격제어가 있습니다. 
1. 원격 제어데이터 전송의 예 :  깃 허브가 있습니다. 원격 저장소, 소스 코드를 원격 저장소인 깃헙에 푸쉬할 때 SSH를 활용해 파일을 전송하게 됩니다.
2. 원격 제어의 예 : AWS와 같은 클라우드 서비스는 인스턴스 서버에 접속하여 해당 머신에 명령을 내리기 위해서 SSH을 통한 접속을 해야합니다.

⭐ SSL과 SSH는 다른것일까요? 같은것일까요? 아님 비슷한것일까요?
"s"는 두 프로토콜에 대해 비슷한 약어로 사용되지만, 그 의미와 용도는 완전히 다릅니다.
HTTPS는 웹 브라우저와 웹 서버 간의 통신을 보호하는 데 사용되는 프로토콜이고, SSH는 원격으로 안전한 접속을 가능하게 하는 프로토콜입니다.(안전한 접속을 통해 파일 전송)
